Billy_Fournier/Rails/Controllers/UserI/app/controllers/users_controller.rb

  def create
    User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Hellen323432"], ["updated_at", "2016-10-13 19:25:29.169526"], ["id", 12]]