Billy_Fournier/Rails/Controllers/ProductsDashboard/app/views/products/edit.html.erb


  <%= f.select :category_id, Category.all.collect { |p| [ p.name, p.id ] }, include_blank: true, :value => @product['category'] %><br />
---
SELECT "categories".* FROM "categories"