Billy_Fournier/Rails/Controllers/ProductsDashboard/app/views/products/new.html.erb


  <%= f.select :category_id, Category.all.collect { |p| [ p.name, p.id ] }, include_blank: true %><br />
---
SELECT "categories".* FROM "categories"