Billy_Fournier/Rails/Controllers/ProductsDashboard/app/controllers/comments_controller.rb

INSERT INTO "comments" ("c_text", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["c_text", "aseecbbb"], ["product_id", 10], ["created_at", "2016-10-14 19:41:38.897821"], ["updated_at", "2016-10-14 19:41:38.897821"]]
---
  def create
    puts '**8***********************8**','',comment_params, '','**8***********************8**'

    Comment.create(comment_params)