Billy_Fournier/Rails/Controllers/ProductsDashboard/app/controllers/products_controller.rb

  def index
    @products = Product.all
    @categories = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"

  def show
    @product = Product.find(params[:id])
    @comments = Comment.all
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"

  def create
    Product.create(product_params)
---
INSERT INTO "products" ("name", "description", "price", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    product = Product.find(params[:id])
    product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "products" SET "name" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Durable Iron Table "], ["price", 10.35], ["updated_at", "2016-10-13 21:07:23.329803"], ["id", 3]]

  def destroy
    product = Product.find(params[:id])
    product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 12]]