Billy_Fournier/Rails/Controllers/IMwtC/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Billy"], ["created_at", "2016-10-11 18:30:35.360016"], ["updated_at", "2016-10-11 18:30:35.360016"]]
---
  def create
    puts params[:name], ' *'
    User.create(name:params[:name])

SELECT COUNT(*) FROM "users"
---
  def total
    @total = User.count(:all)